In [1]:
import pandas as pd
import numpy as np

In [5]:
data = pd.read_csv("statewise__dataset_csv.csv")

In [6]:
data.shape

(110, 14)

In [7]:
data.head()

,state_ut,year,primary_boys,primary_girls,upper_primary_boys,upper_primary_girls,upper_primary_total,secondary_boys,secondary_girls,secondary_total,hr_secondary_boys,hr_secondary_girls,hr_secondary_total,Unnamed: 13
0,A & N Islands,2012-13,0.83,0.51,0.68,Uppe_r_Primary,1.09,1.23,5.57,5.55,5.56,17.66,10.15,14.14
1,A & N Islands,2013-14,1.35,1.06,1.21,NR,1.54,0.51,8.36,5.98,7.2,18.94,12.2,15.87
2,A & N Islands,2014-15,0.47,0.55,0.51,1.44,1.95,1.69,11.47,8.16,9.87,21.05,12.21,16.93
3,Andhra Pradesh,2012-13,3.3,3.05,3.18,3.21,3.51,3.36,12.21,13.25,12.72,2.66,NR,0.35
4,Andhra Pradesh,2013-14,4.31,4.39,4.35,3.46,4.12,3.78,11.95,13.37,12.65,12.65,10.85,11.79

In [8]:
data.describe()

,state_ut,year,primary_boys,primary_girls,upper_primary_boys,upper_primary_girls,upper_primary_total,secondary_boys,secondary_girls,secondary_total,hr_secondary_boys,hr_secondary_girls,hr_secondary_total,Unnamed: 13
count,110,110,110,110,110,110,110,110,110,110,110,110,110,110
unique,40,3,93,87,87,91,97,96,106,107,106,81,76,78
top,A & N Islands,2013-14,NR,NR,NR,NR,NR,NR,NR,NR,NR,NR,NR,NR
freq,3,37,15,15,17,16,8,9,4,4,4,28,34,31

In [9]:
data.corr()

Empty DataFrame
Columns: []
Index: []